{
    "modals": [
        {
            "images": [
                "logo-home@2x.png",
                "knowledgent.v3.cropped.png",
                "etny.v3.png",
                "etny.v3.png",
                "berks.v3.cropped.jpg"
            ],
            "alt": [
                "Amsted Digital Solutions",
                "Knowledgent",
                "Everglades Technologies New York",
                "Everglades Technologies New York",
                "Penn State Berks University"
            ],
            "modal_title": [
                "Web Developer @ Amsted Digital Solutions",
                "Web Developer @ Knowledgent",
                "Independent Web App Developer @ Everglades Technologies",
                "Web App Development Intern @ Everglades Technologies",
                "Student @ Penn State Berks"
            ],
            "modal_inside": [
                "<p itemprop='description'>As the lead web developer for the client facing website on the software team I:</p> <ul><li class='left-align'>Utilize Angular, Node, npm, Typescript, JavaScript, Sass, HTML, CSS and Git.</li><li> Develop scalable and user facing features to customer website.</li><li> Debug existing code to resolve known issues and ensure maintainability.</li><li> Commit to and deliver work in Agile environment.</li><li> Maintain and update the website and it’s underlying packages via npm.</li><li> Manage production deployment of front end for customer facing website and coordinate deployment with team members for API and database.</li><li> Assist with transition from manual deployments to use of pipeline to deploy customer facing website. </li></ul> ",
                "<p itemprop='description'>As a web developer in the IT department I:</p> <ul><li>Utilize HTML, JQuery, JavaScript, CSS, PHP, SQL, VBA.</li><li> Develop user facing and scalable features to internal website.</li><li> Optimize the internal website's functionality in HTML, JQuery, JavaScript, CSS and PHP.</li><li> Generate analytic reports to improve company interpretation of compiled data with PHPExcel.</li><li> Document and test new HTML, JQuery, JavaScript, CSS and PHP features to the internal website.</li><li> Debug JavaScript, JQuery, PHP, CSS and HTML for internal website and provide web administration for users.</li><li> Troubleshoot damaged devices and prepare new devices.</li></ul> ",
                "<p itemprop='description'>I was responsible for updating a previously designed quote application. Throughout the project I made several revisions to the application after meeting with the client. I worked from a remote location while attending college as a full time senior.</p>",
                "<p itemprop='description'>I was responsible for two web applications. First designing and developing an application that would monitor clients IP addresses by pinging them and returning the results on a Google Map. It also sent emails to specified email addresses to notify them of a significant change in the ping function's response. The second was designing and developing a quote application which would allows customers to obtain a price estimate of building a conference room. </p>",
                "<h3 itemprop='alternateName'> Education </h3><p itemprop='description'>I enrolled in Pennsylvania State University at the Berks Campus with the original intention of graduating with a degree in Computer Science. Along the way I realized that I enjoyed more working in Information Sciences and Technology and switched over. I graduated in May 2016 with a Bachelors of Science in Information Sciences and Technology with a major GPA of 3.5.</p><h3 itemprop='alternateName'>Club Activity</h3><p itemprop='description'> In my sophomore year I was a co founder and vice president of the Berks Billiards Club. In my junior year I became president of the Billiards Club. While in this role I was responsible for organizing and coordinating events. In addition I delegated responsibilities to other staff members. </p><h3 itemprop='alternateName'>Volunteer Activities</h3><p itemprop='description'> I was a volunteer at Maimonides Medical Center in the summer of 2012. I was assigned to the ER department and was responsible for assisting with inventory management and communications. </p> <p itemprop='description'> While in college I volunteered to help clean Blue Marsh Lake in Spring 2014. I also volunteered to assist with the first ROY G. BIV color run held at Penn State Berks campus. </p>"
            ],
            "modal_date": [
                "Nov 2017 - Present",
                "Jun 2016 - Oct 2017",
                "Oct 2015",
                "Jun 2015 – Aug 2015",
                "2012 - 2016"
            ],
            "modal_client": [
                "Amsted Digital Solutions",
                "Knowledgent",
                "Everglades Technologies",
                "Everglades Technologies",
                "Pennsylvania State University-Penn State Berks"
            ],
            "modal_service": [
                "Web Development, Web Design",
                "Web Development, Web Administration, IT",
                "Web Development",
                "Web Development, Web Application Development",
                "Bachelor's Degree of Science, Information Technology"
            ]
        }
    ],
    
    "about": "<p>My name is Cyril Kalikin and I enjoy designing and developing applications to solve challenging problems and learning about new software. I graduated from the Pennsylvania State University in May 2016 with a Bachelors Degree in Information Sciences and Technology. </p> <p> During my internship at Everglades Technologies I was a consultant/developer with the company and developed two web applications. Throughout the internship I worked successfully with a wide range of clients between those with knowledge of application development to those without an IT background. After my internship with Everglades Technologies ended I was brought back as an independent developer while attending college as a full time student. After graduation I was employed at Knowledgent as an IT/web developer. During my time there I improved my customer service skills while developing new features to the internal website and maintaining existing functionality on it. I am currently employed at Amsted Digital Solutions as a web developer working primarily with Angular.</p> <p>As a graduate, I am seeking employment so that I can continue to develop my skills in an IT related field. During my time as an intern, consultant and as an independent developer I felt most satisfied when an application was successfully designed and developed to solve a client's problems. My goal is to seek further employment as a web developer as I feel my determination, knowledge and skills would be an asset to a job in this area.</p>",
    
    "skills": "Web Developer - Angular, TypeScript, JavaScript, Node.js, Express.js, EJS, JQuery, HTML, Sass, Git, CSS, JSON, PHP, SQL"
}